Revit 2023 API
GroupTypeId.AnalyticalModel Property
 "Analytical Model"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModel { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModel {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace